#### UIFabricationUtils Members

---

|  |
| --- |
| UIFabricationUtils Class   Methods   See Also |

The  UIFabricationUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | GetOpenConnectorIndicatorAwayColor | Gets the color of the open connector indicator in away direction. |
| Public method Static member | GetOpenConnectorIndicatorPlanColor | Gets the color of the open connector indicator in plan view. |
| Public method Static member | GetOpenConnectorIndicatorTowardsColor | Gets the color of the open connector indicator in towards direction. |
| Public method Static member | SetOpenConnectorIndicatorAwayColor | Sets the color of the open connector indicator in away direction |
| Public method Static member | SetOpenConnectorIndicatorPlanColor | Sets the color of the open connector indicator in plan view. |
| Public method Static member | SetOpenConnectorIndicatorTowardsColor | Sets the color of the open connector indicator in towards direction |

# See Also

UIFabricationUtils Class

Autodesk.Revit.UI Namespace